docs/doc-notes/xiong-2018-critic-review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-13 Mon 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc5c1cd2">1. Notes</a>
<ul>
<li><a href="#org2d037bd">1.1. INTRODUCTION</a></li>
<li><a href="#orge88da89">1.2. SoC ESTIMATION METHODS</a>
<ul>
<li><a href="#org9ae1de6">1.2.1. LOOKING-UP TABLE BASED METHODS</a></li>
<li><a href="#org0f4b7f7">1.2.2. AMPERE-HOUR INTEGRAL METHOD</a></li>
<li><a href="#org4b11d19">1.2.3. MODEL-BASED ESTIMATION METHODS</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc5c1cd2" class="outline-2">
<h2 id="orgc5c1cd2"><span class="section-number-2">1.</span> Notes</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2d037bd" class="outline-3">
<h3 id="org2d037bd"><span class="section-number-3">1.1.</span> INTRODUCTION</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The SoC of a battery is denied as the percentage of the remaining capacity in its maximum available capacity</li>
<li>Early from the year of 1960s, the academics, researchers, scientists have per formed an extensive research to carry out the battery SoC estimation [14], [15].</li>
<li>Thus, this paper hopes to all up the gap by exploring different existing methodologies and addressing the key issues and challenges for the SoC estimation of battery pack</li>
</ul>
</div>
</div>

<div id="outline-container-orge88da89" class="outline-3">
<h3 id="orge88da89"><span class="section-number-3">1.2.</span> SoC ESTIMATION METHODS</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9ae1de6" class="outline-4">
<h4 id="org9ae1de6"><span class="section-number-4">1.2.1.</span> LOOKING-UP TABLE BASED METHODS</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Given an open-circuit voltage, get a SOC from a table.</li>
</ul>
</div>
</div>

<div id="outline-container-org0f4b7f7" class="outline-4">
<h4 id="org0f4b7f7"><span class="section-number-4">1.2.2.</span> AMPERE-HOUR INTEGRAL METHOD</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>When the maximum available capacity of a battery is known and its current can be measured precisely, the ampere-hour integral method can permit the accurate calculation of the variation of the SoC. If we know the initial SoC, we can obtain the accurate SoC.</li>
</ul>

<div class="org-src-container">
<pre class="src src-latex">z_k = z_0 &#8722; <span style="font-weight: bold;">\frac</span>{<span style="font-weight: bold;">\int</span>_{t_0}^{t_k} <span style="font-weight: bold;">\eta</span> I_L t_0(t)dt}{Q}
</pre>
</div>

<p>
where 
</p>

<ul class="org-ul">
<li>\(z\): SOC</li>
<li>\(z_0\): Initial SOC</li>
<li>\(z_k\): SOC at step \(k\)</li>
<li>\(t_k = t_0 + k\cdot \Delta t\)</li>
<li>\(\Delta t\): sample interval</li>
<li>\(\eta\): coulomb efficiency</li>
<li>\(I_L(t)\): load current of batter</li>
<li>\(Q\): maximum capacity</li>
</ul>
</div>
</div>

<div id="outline-container-org4b11d19" class="outline-4">
<h4 id="org4b11d19"><span class="section-number-4">1.2.3.</span> MODEL-BASED ESTIMATION METHODS</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>The most commonly used models can be roughly summarized as three types: electrochemical model (EM), equivalent circuit model (ECM) and electrochemical impedance model (EIM).</li>
<li></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-03-13 Mon 11:04</p>
</div>
</body>
</html>
